mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf46xl/mb9bf46xl.svd
        <!-- REGISTER "ELVR" -->
        <register>
          <name>ELVR</name>
          <description>External Interrupt Factor Level Register [BHW]</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LB15" -->
            <field>
              <name>LB15</name>
              <description>External interrupt request detection level selection bit for INT15</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA15" -->
            <field>
              <name>LA15</name>
              <description>External interrupt request detection level selection bit for INT15</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB14" -->
            <field>
              <name>LB14</name>
              <description>External interrupt request detection level selection bit for INT14</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA14" -->
            <field>
              <name>LA14</name>
              <description>External interrupt request detection level selection bit for INT14</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB13" -->
            <field>
              <name>LB13</name>
              <description>External interrupt request detection level selection bit for INT13</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA13" -->
            <field>
              <name>LA13</name>
              <description>External interrupt request detection level selection bit for INT13</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB12" -->
            <field>
              <name>LB12</name>
              <description>External interrupt request detection level selection bit for INT12</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA12" -->
            <field>
              <name>LA12</name>
              <description>External interrupt request detection level selection bit for INT12</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB11" -->
            <field>
              <name>LB11</name>
              <description>External interrupt request detection level selection bit for INT11</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA11" -->
            <field>
              <name>LA11</name>
              <description>External interrupt request detection level selection bit for INT11</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB10" -->
            <field>
              <name>LB10</name>
              <description>External interrupt request detection level selection bit for INT10</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA10" -->
            <field>
              <name>LA10</name>
              <description>External interrupt request detection level selection bit for INT10</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB9" -->
            <field>
              <name>LB9</name>
              <description>External interrupt request detection level selection bit for INT9</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA9" -->
            <field>
              <name>LA9</name>
              <description>External interrupt request detection level selection bit for INT9</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB8" -->
            <field>
              <name>LB8</name>
              <description>External interrupt request detection level selection bit for INT8</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA8" -->
            <field>
              <name>LA8</name>
              <description>External interrupt request detection level selection bit for INT8</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB7" -->
            <field>
              <name>LB7</name>
              <description>External interrupt request detection level selection bit for INT7</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA7" -->
            <field>
              <name>LA7</name>
              <description>External interrupt request detection level selection bit for INT7</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB6" -->
            <field>
              <name>LB6</name>
              <description>External interrupt request detection level selection bit for INT6</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA6" -->
            <field>
              <name>LA6</name>
              <description>External interrupt request detection level selection bit for INT6</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB5" -->
            <field>
              <name>LB5</name>
              <description>External interrupt request detection level selection bit for INT5</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA5" -->
            <field>
              <name>LA5</name>
              <description>External interrupt request detection level selection bit for INT5</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB4" -->
            <field>
              <name>LB4</name>
              <description>External interrupt request detection level selection bit for INT4</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA4" -->
            <field>
              <name>LA4</name>
              <description>External interrupt request detection level selection bit for INT4</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB3" -->
            <field>
              <name>LB3</name>
              <description>External interrupt request detection level selection bit for INT3</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA3" -->
            <field>
              <name>LA3</name>
              <description>External interrupt request detection level selection bit for INT3</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB2" -->
            <field>
              <name>LB2</name>
              <description>External interrupt request detection level selection bit for INT2</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA2" -->
            <field>
              <name>LA2</name>
              <description>External interrupt request detection level selection bit for INT2</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB1" -->
            <field>
              <name>LB1</name>
              <description>External interrupt request detection level selection bit for INT1</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA1" -->
            <field>
              <name>LA1</name>
              <description>External interrupt request detection level selection bit for INT1</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB0" -->
            <field>
              <name>LB0</name>
              <description>External interrupt request detection level selection bit for INT0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA0" -->
            <field>
              <name>LA0</name>
              <description>External interrupt request detection level selection bit for INT0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
